{
    "Narrow Down Your Search" : [
        "Determine what type of home best suits your needs - traditional single-family, townhouse, condo, or apartment.",
        "Determine what house condition best suits your needs - fixer-upper or move-in ready.",
        "Determine what specific features your ideal home will have - some flexibility is good, but knowing in advance how many rooms or bathrooms you need, whether you want a garage or can live without one will help keep you from looking at houses that will not suit your needs.",
        "Determine what type of neighborhood you want. This will help keep you from looking at houses that are in neighborhoods you end up not feeling comfortable in or that are inconvenient for your family."
    ],
    "Financing Your New Home" : [
        "Get pre-qualified for a loan so that you know your maximum house price.",
        "Create a detailed household budget so you know how much you can afford on a housing payment. Then use a mortgage calculator to see what house price would best fit your budget. ",
        "Look at the various types of loans and their pro’s and con’s. For instance 30 year loans vs 15 year loans, or Conventional Loans vs VA Loans vs Adjustable-Rate Mortgages (ARM) vs FHA Loans.",
        "Consider how much down payment you will need. Most loans will require 20% down. Some lenders may be more flexible and VA loans usually do not require one at all.",
        "Consider how much you can put down. While most loans require a minimum of 20%, the more you put down the less you end up spending on interest and the lower your monthly payments will be.",
        "Show around for your loan. Especially finding a lower rate can make a significant difference in your monthly payment and how much you end up spending on interest over the course of your loan.",
        "When determining how much house you can afford, don’t forget to include property taxes, insurance, private mortgage insurance if your lender requires it, and whether you pay an HOA in addition to the principle and interest. ",
        "Consider the cost of utilities at a new house when preparing your budget. If you are moving to a new area, you may need to research ahead and see if utilities are more than what you’re used to.",
        "If moving to a new area, consider the difference in the cost of living when preparing your budget. Using a tool to help you determine this in advance can ensure you don’t end up over your head.",
        "Know your credit score. If your score is low, work on improving it. This can help you find lower interest rates which will make a significant difference in your monthly payments and how much you pay over the course of the loan."
    ],
    "Buying Your New Home" : [
        "Talk to your real estate agent to determine a reasonable offer and any other conditions that you may want to ask for.",
        "Prepare to make a deposit until you close if you reach an agreement.",
        "Obtain a home inspection. This will ensure the home you’re buying is not hiding any surprises. This can save you a significant amount of money down the road.",
        "If your home inspection uncovers a significant flaw, discuss with your agent whether you can ask the seller to fix it. If not, consider how you will include it in your budget.",
        "Take time to consider the results of your home inspection and the details of the house, such as size, neighborhood, etc. Acting quickly usually means acting on emotion, which is never a good basis for a home purchase.",
    ],
    "Search For A Home: " : [
        "Find a real estate agent who specializes in finding the type of house you are looking for. You might think to save the cost of an agent, but having an agent who can save you time and help negotiate an offer can make the process smoother and cost less in the end.",
        "Look around for yourself, even if you have an agent. This can help you get a better feel for what’s available.",
        "Take your time. Being in a hurry can result in a home purchase that you will end up not happy with.",
        "Don’t wait for the “unicorn”. You may have an idea of what the perfect house in the perfect neighborhood for the perfect price may be. Keep in mind that exact house may not exist, and know where you can be flexible.",
        "Don’t look at too many houses at once, as this can make it very difficult to focus on comparing them. A good rule of thumb is to be looking at a maximum of 5-7 houses at any given time.",
    ]
}
